# Overview

Pandas is an opensource library built on top of NumPy. It allows for fast analysis and data cleaning / preparation. Pandas supports Data Frames like in R, where you can have named rows and columns.

Pandas is great for performance and productivity, has built-in visualization features, and works with a wide variety of data sources.

In [1]:
import pandas as pd

stats = pd.read_csv('../data/Birth-Internet-Income-Per-Country.csv')

# Series

A Pandas series is a lot like a Numpy array, but it has an index and a type that you can manage.

In [2]:
import numpy as np
import pandas as pd

labels = [ 'a', 'b', 'c' ]
my_data = [ 10, 20, 30 ]
arr = np.array( my_data )
d = { 'a': 10, 'b': 20, 'c': 30 }

### Creating a Series

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series( data = my_data, index = labels )

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series( arr, labels )

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series( d )

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series( labels )

0    a
1    b
2    c
dtype: object

In [8]:
pd.Series( data=[sum, print, len ])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Indexing

In [9]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])
ser3 = pd.Series( data = labels )

In [10]:
print( ser1 )
ser1['USA']

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

1

In [11]:
print(ser3)
ser3[0]

0    a
1    b
2    c
dtype: object

'a'

In [12]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Creating Dataframes

A DataFrame is basically just a bunch of Series strung together. In this example, each column (`W`, `X`, `Y`, and `Z`) is a series.

In [13]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

### Creating Using Arrays

In [14]:
data = randn(5, 4)
row_index = ['A', 'B', 'C', 'D', 'E']
col_names = ['W', 'X', 'Y', 'Z']

df = pd.DataFrame( data=data, index=row_index, columns=col_names )
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
# The whole think is a DataFrame
print( type( df ) )

<class 'pandas.core.frame.DataFrame'>

In [16]:
# Each row is a Series
row_w = df['W']
print( type( row_w ))

<class 'pandas.core.series.Series'>

### Creating Using a Dictionary

In [17]:
d = { 'A': [1,2,3], 'B':[5,6,7], 'C':[7,8,9] }
dict_df = pd.DataFrame( d )
dict_df

   A  B  C
0  1  5  7
1  2  6  8
2  3  7  9

# Exploring Dataframes

In [18]:
stats

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [19]:
# Give the columns names without spaces
stats.columns = [ 'CountryName', 'CountryCode', 'BirthRate', 'InternetUsers', 'IncomeGroup' ]
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

### len()

In [20]:
len( stats )

195

### shape

The `shape` attribute gives a tuple of rows and columns.

In [21]:
stats.shape

(195, 5)

### Columns

In [22]:
stats.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

### Number of Columns

In [23]:
len( stats.columns )

5

### Head and Tail

In [24]:
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [25]:
stats.head( 8 )

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
5,Argentina,ARG,17.716,59.9,High income
6,Armenia,ARM,13.308,41.9,Lower middle income
7,Antigua and Barbuda,ATG,16.447,63.4,High income

In [26]:
stats[ 20:100 ].head( 7 )

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
20,Belarus,BLR,12.500,54.17,Upper middle income
21,Belize,BLZ,23.092,33.60,Upper middle income
22,Bermuda,BMU,10.400,95.30,High income
23,Bolivia,BOL,24.236,36.94,Lower middle income
24,Brazil,BRA,14.931,51.04,Upper middle income
25,Barbados,BRB,12.188,73.00,High income
26,Brunei Darussalam,BRN,16.405,64.50,High income

In [27]:
stats.tail()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

### info()

In [28]:
stats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CountryName    195 non-null    object
 1   CountryCode    195 non-null    object
 2   BirthRate      195 non-null    float64
 3   InternetUsers  195 non-null    float64
 4   IncomeGroup    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

### describe()

Looks at all numeric fields and gives statistical analysis across all observations.

In [29]:
stats.describe()

        BirthRate  InternetUsers
count  195.000000     195.000000
mean    21.469928      42.076471
std     10.605467      29.030788
min      7.900000       0.900000
25%     12.120500      14.520000
50%     19.680000      41.000000
75%     29.759500      66.225000
max     49.661000      96.546800

In [30]:
stats.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
BirthRate,195.0,21.469928,10.605467,7.9,12.1205,19.68,29.7595,49.6610
InternetUsers,195.0,42.076471,29.030788,0.9,14.5200,41.00,66.2250,96.5468

### Unqiue Values in a Column

In [31]:
print( stats['IncomeGroup'].unique() )
print( stats['IncomeGroup'].nunique() )

['High income' 'Low income' 'Upper middle income' 'Lower middle income']
4

### Value Counts

In [168]:
stats[ 'IncomeGroup' ].value_counts()

High income            67
Lower middle income    50
Upper middle income    48
Low income             30
Name: IncomeGroup, dtype: int64

In [169]:
stats.value_counts()

CountryName    CountryCode  BirthRate  InternetUsers  IncomeGroup
Zimbabwe       ZWE          35.715     18.5000        Low income             1
Denmark        DNK          10.000     94.6297        High income            1
Guam           GUM          17.389     65.4000        High income            1
Grenada        GRD          19.334     35.0000        Upper middle income    1
Greenland      GRL          14.500     65.8000        High income            1
                                                                            ..
New Zealand    NZL          13.120     82.7800        High income            1
New Caledonia  NCL          17.000     66.0000        High income            1
Netherlands    NLD          10.200     93.9564        High income            1
Nepal          NPL          20.923     13.3000        Low income             1
Afghanistan    AFG          35.253     5.9000         Low income             1
Length: 195, dtype: int64

# Slicing / Filtering Dataframes

### Accessing a Single Element

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

**Using `loc`**

In [33]:
df.loc['A','W'] # row, column

2.706849839399938

**Using `iloc`**

In [34]:
df.iloc[3, 0] # row, column

0.18869530944922425

**Bracket Notation**

Columns are accessed by name, rows by number.

In [35]:
df['W']['D'] #[row label][column label]

0.18869530944922425

In [36]:
df['W'][3] # [row label][column index]

0.18869530944922425

**Bracket Range Notation**

In [37]:
df[3:4]['W']

D    0.188695
Name: W, dtype: float64

In [38]:
df['W'][3:4]

D    0.188695
Name: W, dtype: float64

### Accessing a Single Column

You can access columns by name (assuming they don't have spaces):

In [39]:
stats.CountryName

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: CountryName, Length: 195, dtype: object

But, it's best to just access them using the bracket notation with the column name in quotes. This convention prevents confusion when you have columns whose names collide with the methods available on the DataFrame:

In [40]:
stats[ 'CountryName' ]

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: CountryName, Length: 195, dtype: object

### Slicing Rows with `:` (Range Operator)

In [41]:
stats[0:5]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [42]:
stats[1:2]

   CountryName CountryCode  BirthRate  InternetUsers IncomeGroup
1  Afghanistan         AFG     35.253            5.9  Low income

Using the range operator, if you select a single row, you'll get a DataFrame back. This is different than the behavior with `loc`, which we'll see below.

In [43]:
type( stats[1:2 ])

pandas.core.frame.DataFrame

In [44]:
stats[0:100:10]

   CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0        Aruba         ABW     10.244      78.900000          High income
10  Azerbaijan         AZE     18.300      58.700000  Upper middle income
20     Belarus         BLR     12.500      54.170000  Upper middle income
30      Canada         CAN     10.900      85.800000          High income
40  Costa Rica         CRI     15.022      45.960000  Upper middle income
50     Ecuador         ECU     21.070      40.353684  Upper middle income
60       Gabon         GAB     30.555       9.200000  Upper middle income
70   Greenland         GRL     14.500      65.800000          High income
80       India         IND     20.291      15.100000  Lower middle income
90  Kazakhstan         KAZ     22.730      54.000000  Upper middle income

### Slicing Rows with `loc`

You can use `loc` to access rows by range, or by label names.

In [45]:
stats.loc[0:5:2]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
2,Angola,AGO,45.985,19.1,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

If your dataframe has row labels, you can also use those.

In [46]:
df = pd.DataFrame( randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

If you select just a single row, you'll get a Series back:

In [47]:
type( df.loc[ 'A' ] )

pandas.core.series.Series

But, if you select multiple rows, you'll get a DataFrame:

In [48]:
df.loc[[ 'A', 'C', 'E'] ]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [49]:
type( df.loc[[ 'A', 'C', 'E'] ] )

pandas.core.frame.DataFrame

### Slicing Rows with `iloc`

You can use `iloc` to access rows by range or by index.

In [50]:
stats.iloc[0:5]

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [51]:
stats.iloc[ 5 ]

CountryName        Argentina
CountryCode              ARG
BirthRate             17.716
InternetUsers           59.9
IncomeGroup      High income
Name: 5, dtype: object

In [52]:
type( stats.iloc[ 5 ] )

pandas.core.series.Series

### Accessing a Subset of Columns

In [53]:
columns = [ 'CountryName', 'CountryCode' ]
stats[ columns ]

              CountryName CountryCode
0                   Aruba         ABW
1             Afghanistan         AFG
2                  Angola         AGO
3                 Albania         ALB
4    United Arab Emirates         ARE
..                    ...         ...
190           Yemen, Rep.         YEM
191          South Africa         ZAF
192      Congo, Dem. Rep.         COD
193                Zambia         ZMB
194              Zimbabwe         ZWE

[195 rows x 2 columns]

In [54]:
stats[ [ 'CountryName', 'CountryCode' ] ]

              CountryName CountryCode
0                   Aruba         ABW
1             Afghanistan         AFG
2                  Angola         AGO
3                 Albania         ALB
4    United Arab Emirates         ARE
..                    ...         ...
190           Yemen, Rep.         YEM
191          South Africa         ZAF
192      Congo, Dem. Rep.         COD
193                Zambia         ZMB
194              Zimbabwe         ZWE

[195 rows x 2 columns]

### Slicing Rows and Columns

**Using names and ranges**

Since string lists are applied to columns and ranges are applied to rows, the order doesn't matter.

In [55]:
stats[ [ 'CountryName', 'CountryCode' ] ][ 0:5 ]

            CountryName CountryCode
0                 Aruba         ABW
1           Afghanistan         AFG
2                Angola         AGO
3               Albania         ALB
4  United Arab Emirates         ARE

In [56]:
stats[ 0:5 ][ [ 'CountryName', 'CountryCode' ] ]

            CountryName CountryCode
0                 Aruba         ABW
1           Afghanistan         AFG
2                Angola         AGO
3               Albania         ALB
4  United Arab Emirates         ARE

**Using `loc`**

If both the rows and columns are named, you can use `loc`.

In [57]:
df.loc['B':'D', 'Y':'Z']

          Y         Z
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752

In [58]:
df.loc[ [ 'A','C' ], [ 'W', 'Z' ] ]

          W         Z
A  0.302665 -1.159119
C  0.807706  0.329646

**Using `iloc`**

In [59]:
# [ row:range, col:range ]
stats.iloc[ 2:4, 2:4 ]

   BirthRate  InternetUsers
2     45.985           19.1
3     12.877           57.2

In [60]:
# [[row,list], [col,list]]
stats.iloc[ [ 1, 3 ], [ 1, 4 ] ]

  CountryCode          IncomeGroup
1         AFG           Low income
3         ALB  Upper middle income

### Conditional Selection

As long as all the columns of a given DataFrame are the same type, you can use a conditional operator and get a DataFrame of conditionals, where each cell in the output DataFrame reflects the output of the given conditional operation applied to the input DataFrame.

In [61]:
booldf = df < 1
booldf

      W      X     Y      Z
A  True  False  True   True
B  True   True  True   True
C  True   True  True   True
D  True   True  True   True
E  True  False  True  False

When we pass the boolean DataFrame back into the original DataFrame, it will filter the original DataFrame. The true values will result in the number and the false values will result in a `NaN` in this case, since the original values were all of type int.

In [62]:
df[ booldf ]

          W         X         Y         Z
A  0.302665       NaN -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773       NaN  0.238127       NaN

You can also do conditional selection on a single column. It will return a Series of type `bool`.

In [63]:
filter = stats.InternetUsers < 10
print( type( filter ))
filter.head()

<class 'pandas.core.series.Series'>

0    False
1     True
2    False
3    False
4    False
Name: InternetUsers, dtype: bool

When you filter using a Series of type `bool`, the resulting DataFrame will include rows where the Series was `True` and exclude rows where the Series was `False`.

In [64]:
# Pass in a frame of booleans that will be used to filter out the results
filter = stats.InternetUsers < 10
stats[ filter ].head()

     CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
1    Afghanistan         AFG     35.253           5.90           Low income
11       Burundi         BDI     44.151           1.30           Low income
13         Benin         BEN     36.440           4.90           Low income
14  Burkina Faso         BFA     40.551           9.10           Low income
15    Bangladesh         BGD     20.142           6.63  Lower middle income

In [65]:
# Pass in a frame of booleans that will be used to filter out the results
stats[ stats.InternetUsers < 10 ].head()

     CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
1    Afghanistan         AFG     35.253           5.90           Low income
11       Burundi         BDI     44.151           1.30           Low income
13         Benin         BEN     36.440           4.90           Low income
14  Burkina Faso         BFA     40.551           9.10           Low income
15    Bangladesh         BGD     20.142           6.63  Lower middle income

In [66]:
# Have to use the elementwise `&` and not `and`
stats[ ( stats.InternetUsers < 10 ) & ( stats.BirthRate > 40 ) ].head()

      CountryName CountryCode  BirthRate  InternetUsers IncomeGroup
11        Burundi         BDI     44.151            1.3  Low income
14   Burkina Faso         BFA     40.551            9.1  Low income
115          Mali         MLI     44.138            3.5  Low income
127         Niger         NER     49.661            1.7  Low income
156       Somalia         SOM     43.891            1.5  Low income

In [67]:
stats[ stats['CountryName'] == 'Mali' ]

    CountryName CountryCode  BirthRate  InternetUsers IncomeGroup
115        Mali         MLI     44.138            3.5  Low income

After filtering with a conditional selection, you just get a DataFrame back, so you can continue to operate on the results. Here, we just grab a specific set of column from the result.

In [68]:
stats[ stats[ 'CountryName' ] == 'Mali' ][ [ 'CountryCode', 'IncomeGroup' ] ]

    CountryCode IncomeGroup
115         MLI  Low income

### `at()` and `iat()`

In [69]:
stats[::10].head()

   CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
0        Aruba         ABW     10.244          78.90          High income
10  Azerbaijan         AZE     18.300          58.70  Upper middle income
20     Belarus         BLR     12.500          54.17  Upper middle income
30      Canada         CAN     10.900          85.80          High income
40  Costa Rica         CRI     15.022          45.96  Upper middle income

In [70]:
stats[::10].iat[ 1, 1 ]

'AZE'

In [71]:
stats[::10].at[ 30, 'BirthRate' ]

10.9

# Modifying Dataframes

### Renaming Columns

In [72]:
stats.columns = [ 'CountryName', 'CountryCode', 'BirthRate', 'InternetUsers', 'IncomeGroup' ]
stats.columns

Index(['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers',
       'IncomeGroup'],
      dtype='object')

### Adding a Column

You can add a column using a column (i.e. series) operation:

In [73]:
stats[ 'MyNewColumn' ] = stats.BirthRate * stats.InternetUsers
stats[ 'MyNewColumn2' ] = stats.BirthRate * 5
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup,MyNewColumn,MyNewColumn2
0,Aruba,ABW,10.244,78.9,High income,808.2516,51.220
1,Afghanistan,AFG,35.253,5.9,Low income,207.9927,176.265
2,Angola,AGO,45.985,19.1,Upper middle income,878.3135,229.925
3,Albania,ALB,12.877,57.2,Upper middle income,736.5644,64.385
4,United Arab Emirates,ARE,11.044,88.0,High income,971.8720,55.220

You can also add a column by creating a new series and assigning it to a column name:

In [74]:
stats[ 'ColumnAsSeries' ] = pd.Series( [1, 2, 3 ] )
stats

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup,MyNewColumn,MyNewColumn2,ColumnAsSeries
0,Aruba,ABW,10.244,78.9,High income,808.2516,51.220,1.0
1,Afghanistan,AFG,35.253,5.9,Low income,207.9927,176.265,2.0
2,Angola,AGO,45.985,19.1,Upper middle income,878.3135,229.925,3.0
3,Albania,ALB,12.877,57.2,Upper middle income,736.5644,64.385,NaN
4,United Arab Emirates,ARE,11.044,88.0,High income,971.8720,55.220,NaN
...,...,...,...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income,658.9400,164.735,NaN
191,South Africa,ZAF,20.850,46.5,Upper middle income,969.5250,104.250,NaN
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income,93.2668,211.970,NaN
193,Zambia,ZMB,40.471,15.4,Lower middle income,623.2534,202.355,NaN
194,Zimbabwe,ZWE,35.715,18.5,Low income,660.7275,178.575,NaN

### Setting an Index

In [75]:
new_column = 'CA NY TX FL CO'.split()
df[ 'State' ] = new_column
df.set_index( 'State' )

              W         X         Y         Z
State
CA     0.302665  1.693723 -1.706086 -1.159119
NY    -0.134841  0.390528  0.166905  0.184502
TX     0.807706  0.072960  0.638787  0.329646
FL    -0.497104 -0.754070 -0.943406  0.484752
CO    -0.116773  1.901755  0.238127  1.996652

### Removing a Column

You can use drop, but it won't happen "in place" by default.

In [76]:
stats[ 'MyNewColumn' ] = stats.BirthRate * stats.InternetUsers
stats.drop( 'MyNewColumn', axis=1 )
stats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CountryName     195 non-null    object
 1   CountryCode     195 non-null    object
 2   BirthRate       195 non-null    float64
 3   InternetUsers   195 non-null    float64
 4   IncomeGroup     195 non-null    object
 5   MyNewColumn     195 non-null    float64
 6   MyNewColumn2    195 non-null    float64
 7   ColumnAsSeries  3 non-null      float64
dtypes: float64(5), object(3)
memory usage: 12.3+ KB

It will effectively create a copy of the DataFrame, so you need to assign it back to the original data frame (or another variable) if you want the change to be persistent.

In [77]:
# axis=1 means the columns
stats = stats.drop( 'MyNewColumn', axis=1 )
stats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CountryName     195 non-null    object
 1   CountryCode     195 non-null    object
 2   BirthRate       195 non-null    float64
 3   InternetUsers   195 non-null    float64
 4   IncomeGroup     195 non-null    object
 5   MyNewColumn2    195 non-null    float64
 6   ColumnAsSeries  3 non-null      float64
dtypes: float64(4), object(3)
memory usage: 10.8+ KB

Another approach is to provide the `inplace` parameter, which obviates the need to assign it by applying the change directly to the dataframe you're operating on. You can also provide the `errors` argument and set it to `ignore` so that it doesn't throw an error if the column doesn't exist.

In [78]:
stats.drop( 'MyNewColumn', axis=1, inplace=True, errors='ignore' )
stats.drop( 'MyNewColumn2', axis=1, inplace=True, errors='ignore' )
stats.drop( 'ColumnAsSeries', axis=1, inplace=True, errors='ignore' )
stats.drop( 'fooBarMadeUp', axis=1, inplace=True, errors='ignore' )
df.drop( 'State', axis=1, inplace=True, errors='ignore' )

In [79]:
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [80]:
df.head()

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Dropping a Row

You can drop a row by name as well.

In [81]:
stats.drop( 0 ).head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
5,Argentina,ARG,17.716,59.9,High income

Drop defaults to `axis=0`, which applies the operation to rows.

In [82]:
stats.drop(0, axis=0 ).head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
5,Argentina,ARG,17.716,59.9,High income

### Missing and Duplicate Data

In [83]:
d = { 'A': [1,2,np.nan,1], 'B':[5,np.nan,np.nan,5], 'C':[1,2,np.nan,1] }
missing_df = pd.DataFrame( d )
missing_df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN
3  1.0  5.0  1.0

In [84]:
missing_df.dropna( how='any' )

     A    B    C
0  1.0  5.0  1.0
3  1.0  5.0  1.0

In [85]:
missing_df.drop_duplicates( keep='last' )

     A    B    C
1  2.0  NaN  2.0
2  NaN  NaN  NaN
3  1.0  5.0  1.0

In [86]:
missing_df.fillna( 999 )

       A      B      C
0    1.0    5.0    1.0
1    2.0  999.0    2.0
2  999.0  999.0  999.0
3    1.0    5.0    1.0

### Converting a Column Type to Categorical

In [87]:
movies = pd.read_csv('../data/Movie-Ratings.csv')
movies.columns = [ 'Film', 'Genre', 'CriticRating', 'AudienceRating', 'Budget', 'Year' ]

movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Film            559 non-null    object
 1   Genre           559 non-null    object
 2   CriticRating    559 non-null    int64
 3   AudienceRating  559 non-null    int64
 4   Budget          559 non-null    int64
 5   Year            559 non-null    int64
dtypes: int64(4), object(2)
memory usage: 26.3+ KB

In [88]:
# Year shows up because it is an int64
movies.describe()

       CriticRating  AudienceRating      Budget         Year
count    559.000000      559.000000  559.000000   559.000000
mean      47.309481       58.744186   50.236136  2009.152057
std       26.413091       16.826887   48.731817     1.362632
min        0.000000        0.000000    0.000000  2007.000000
25%       25.000000       47.000000   20.000000  2008.000000
50%       46.000000       58.000000   35.000000  2009.000000
75%       70.000000       72.000000   65.000000  2010.000000
max       97.000000       96.000000  300.000000  2011.000000

In [89]:
print( movies.Genre.unique() )
print( movies.Year.unique() )

['Comedy' 'Adventure' 'Action' 'Horror' 'Drama' 'Romance' 'Thriller']
[2009 2008 2010 2007 2011]

In [90]:
movies.Film = movies.Film.astype( 'category' )
movies.Genre = movies.Genre.astype( 'category' )
movies.Year = movies.Year.astype( 'category' )

In [91]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Film            559 non-null    category
 1   Genre           559 non-null    category
 2   CriticRating    559 non-null    int64
 3   AudienceRating  559 non-null    int64
 4   Budget          559 non-null    int64
 5   Year            559 non-null    category
dtypes: category(3), int64(3)
memory usage: 40.3 KB

In [92]:
# Get all the unique category values
movies.Genre.cat.categories

Index(['Action', 'Adventure', 'Comedy', 'Drama', 'Horror', 'Romance',
       'Thriller'],
      dtype='object')

In [93]:
# Year will no longer show up because it is now a category
movies.describe()

       CriticRating  AudienceRating      Budget
count    559.000000      559.000000  559.000000
mean      47.309481       58.744186   50.236136
std       26.413091       16.826887   48.731817
min        0.000000        0.000000    0.000000
25%       25.000000       47.000000   20.000000
50%       46.000000       58.000000   35.000000
75%       70.000000       72.000000   65.000000
max       97.000000       96.000000  300.000000

# Merging, Joining, and Concatenating

In [94]:
concat_df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                           'B': ['B0', 'B1', 'B2', 'B3'],
                           'C': ['C0', 'C1', 'C2', 'C3'],
                           'D': ['D0', 'D1', 'D2', 'D3']},
                           index=[0, 1, 2, 3])

In [95]:
concat_df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                           'B': ['B4', 'B5', 'B6', 'B7'],
                           'C': ['C4', 'C5', 'C6', 'C7'],
                           'D': ['D4', 'D5', 'D6', 'D7']},
                           index=[4, 5, 6, 7])

In [96]:
concat_df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                           'B': ['B8', 'B9', 'B10', 'B11'],
                           'C': ['C8', 'C9', 'C10', 'C11'],
                           'D': ['D8', 'D9', 'D10', 'D11']},
                           index=[8, 9, 10, 11])

In [97]:
concat_df4 = pd.DataFrame({'E': ['E0', 'E1', 'E2', 'E3'],
                           'F': ['F0', 'F1', 'F2', 'F3'],
                           'G': ['G0', 'G1', 'G2', 'G3'],
                           'H': ['H0', 'H1', 'H2', 'H3']},
                           index=[0, 1, 2, 3])

In [98]:
concat_df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [99]:
concat_df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [100]:
concat_df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenation

In [101]:
pd.concat( [concat_df1, concat_df2, concat_df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [102]:
pd.concat( objs=[concat_df1, concat_df4], axis=1)

    A   B   C   D   E   F   G   H
0  A0  B0  C0  D0  E0  F0  G0  H0
1  A1  B1  C1  D1  E1  F1  G1  H1
2  A2  B2  C2  D2  E2  F2  G2  H2
3  A3  B3  C3  D3  E3  F3  G3  H3

In [103]:
pd.concat( objs=[concat_df1, concat_df2, concat_df3, concat_df4], axis=1)

,A,B,C,D,A,B,C,D,A,B,C,D,E,F,G,H
0,A0,B0,C0,D0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,E0,F0,G0,H0
1,A1,B1,C1,D1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,E1,F1,G1,H1
2,A2,B2,C2,D2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,E2,F2,G2,H2
3,A3,B3,C3,D3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,E3,F3,G3,H3
4,NaN,NaN,NaN,NaN,A4,B4,C4,D4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,A5,B5,C5,D5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,A6,B6,C6,D6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,A7,B7,C7,D7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A8,B8,C8,D8,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A9,B9,C9,D9,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A10,B10,C10,D10,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,A11,B11,C11,D11,NaN,NaN,NaN,NaN

### Merging

In [104]:
merge_left_df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                                'A': ['A0', 'A1', 'A2', 'A3'],
                                'B': ['B0', 'B1', 'B2', 'B3']})
   
merge_right_df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                                 'C': ['C0', 'C1', 'C2', 'C3'],
                                 'D': ['D0', 'D1', 'D2', 'D3']})    

merge_left_df2 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                               'key2': ['K0', 'K1', 'K0', 'K1'],
                                  'A': ['A0', 'A1', 'A2', 'A3'],
                                  'B': ['B0', 'B1', 'B2', 'B3']})
    
merge_right_df2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                                'key2': ['K0', 'K0', 'K0', 'K0'],
                                   'C': ['C0', 'C1', 'C2', 'C3'],
                                   'D': ['D0', 'D1', 'D2', 'D3']})

In [105]:
merge_left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [106]:
merge_right_df

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [107]:
merge_left_df2

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [108]:
merge_right_df2

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

The `merge()` function merges two DataFrames together based on common values in one or more columns.

Inner join on single key

In [109]:
pd.merge( merge_left_df, merge_right_df, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Inner join on multiple keys

In [110]:
pd.merge( merge_left_df2, merge_right_df2, on=[ 'key1', 'key2' ] )

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

Outer join on multiple keys

In [111]:
pd.merge( merge_left_df2, merge_right_df2, how='outer', on=[ 'key1', 'key2' ] )

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

Right join on multiple keys

In [112]:
pd.merge( merge_left_df2, merge_right_df2, how='right', on=[ 'key1', 'key2' ] )

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

### Joining

Joining is like a merge, but the keys that are compared are on the row index or on a key column.

In [113]:
left_join_df = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                             'B': ['B0', 'B1', 'B2']},
                            index=['K0', 'K1', 'K2']) 

right_join_df = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                              'D': ['D0', 'D2', 'D3']},
                             index=['K0', 'K2', 'K3'])

In [114]:
left_join_df

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [115]:
right_join_df

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [116]:
left_join_df.join( right_join_df )

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

`left.join( right )` can effectively be accomplished using merge as well, but the join is a lot easier to read:

In [117]:
pd.merge( left_join_df, right_join_df, left_index=True, right_index=True, how='left' )

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [118]:
left_join_df.join( right_join_df, how='outer' )

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [119]:
right_join_df.join( left_join_df )

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

# Sorting

In [214]:
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [218]:
stats.sort_values(by='BirthRate', ascending=False).head()

    CountryName CountryCode  BirthRate  InternetUsers          IncomeGroup
127       Niger         NER     49.661            1.7           Low income
2        Angola         AGO     45.985           19.1  Upper middle income
167        Chad         TCD     45.745            2.3           Low income
11      Burundi         BDI     44.151            1.3           Low income
115        Mali         MLI     44.138            3.5           Low income

# Multi-Level Index Dataframes

### Creating a Multi-Level Index

You can create DataFrames with an index hierarchy.

In [120]:
outside = [ 'Monday', 'Monday', 'Monday', 'Tuesday', 'Tuesday', 'Tuesday' ]
inside = [ 1, 2, 3, 1, 2, 3 ]
hier_index = list( zip( outside, inside ) )

print(hier_index)

hier_index = pd.MultiIndex.from_tuples( hier_index )

print(hier_index)

[('Monday', 1), ('Monday', 2), ('Monday', 3), ('Tuesday', 1), ('Tuesday', 2), ('Tuesday', 3)]
MultiIndex([( 'Monday', 1),
            ( 'Monday', 2),
            ( 'Monday', 3),
            ('Tuesday', 1),
            ('Tuesday', 2),
            ('Tuesday', 3)],
           )

In [121]:
multi_level_df = pd.DataFrame( data=randn( 6, 2 ), index=hier_index, columns=['A', 'B'])
multi_level_df

                  A         B
Monday  1 -0.993263  0.196800
        2 -1.136645  0.000366
        3  1.025984 -0.156598
Tuesday 1 -0.031579  0.649826
        2  2.154846 -0.610259
        3 -0.755325 -0.346419

### Changing the Labels

In [122]:
multi_level_df.index.names = [ 'DOW', 'Num' ]

In [123]:
multi_level_df

                    A         B
DOW     Num
Monday  1   -0.993263  0.196800
        2   -1.136645  0.000366
        3    1.025984 -0.156598
Tuesday 1   -0.031579  0.649826
        2    2.154846 -0.610259
        3   -0.755325 -0.346419

### Getting All Elements of the Outside Index

In [124]:
multi_level_df.loc[ 'Monday' ]

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [125]:
multi_level_df.loc[ 'Monday' ].loc[ 1 ]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [126]:
multi_level_df.loc[ 'Monday' ].loc[ 1 ]['B']

0.19679950499134005

### Cross Section

The `xs` method let's you filter on an index at any level.

In [127]:
multi_level_df

                    A         B
DOW     Num
Monday  1   -0.993263  0.196800
        2   -1.136645  0.000366
        3    1.025984 -0.156598
Tuesday 1   -0.031579  0.649826
        2    2.154846 -0.610259
        3   -0.755325 -0.346419

In [128]:
multi_level_df.xs( 'Monday' )

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [129]:
# Get all the Num=1 across the different DOWs
multi_level_df.xs( 1, level='Num' )

                A         B
DOW
Monday  -0.993263  0.196800
Tuesday -0.031579  0.649826

# Functions

### `apply()`

In [177]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [198]:
def times2(x):
    return x*2

df[ 'W2' ] = df['W'].apply(times2)
df

          W         X         Y         Z        W2
A  0.302665  1.693723 -1.706086 -1.159119  0.605331
B -0.134841  0.390528  0.166905  0.184502 -0.269681
C  0.807706  0.072960  0.638787  0.329646  1.615412
D -0.497104 -0.754070 -0.943406  0.484752 -0.994208
E -0.116773  1.901755  0.238127  1.996652 -0.233547

In [197]:
# Just cleaning up
df.drop( 'W2', axis=1, inplace=True, errors='ignore' )

In [206]:
stats['CountryName'].apply( len ).head()

0     5
1    11
2     6
3     7
4    20
Name: CountryName, dtype: int64

In [212]:
stats['InternetUsers'].apply( lambda x: x*4 ).head()

0    315.6
1     23.6
2     76.4
3    228.8
4    352.0
Name: InternetUsers, dtype: float64

### `drop()`

In [174]:
new_column = 'CA NY TX FL CO'.split()
df[ 'State' ] = new_column
df

          W         X         Y         Z State
A  0.302665  1.693723 -1.706086 -1.159119    CA
B -0.134841  0.390528  0.166905  0.184502    NY
C  0.807706  0.072960  0.638787  0.329646    TX
D -0.497104 -0.754070 -0.943406  0.484752    FL
E -0.116773  1.901755  0.238127  1.996652    CO

In [175]:
df.drop( 'State', axis=1, inplace=True, errors='ignore' )
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### `drop_duplicates()`

In [130]:
d = { 'A': [1,2,np.nan,1], 'B':[5,np.nan,np.nan,5], 'C':[1,2,np.nan,1] }
drop_duplicates_df = pd.DataFrame( d )
drop_duplicates_df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN
3  1.0  5.0  1.0

In [131]:
drop_duplicates_df.drop_duplicates( keep='first' )

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN

In [132]:
drop_duplicates_df.drop_duplicates( keep='last' )

     A    B    C
1  2.0  NaN  2.0
2  NaN  NaN  NaN
3  1.0  5.0  1.0

In [133]:
drop_duplicates_df.drop_duplicates( keep='last', ignore_index=True )

     A    B    C
0  2.0  NaN  2.0
1  NaN  NaN  NaN
2  1.0  5.0  1.0

### `dropna()`

In [134]:
d = { 'A': [1,2,np.nan,1,np.nan], 'B':[5,np.nan,np.nan,5,7], 'C':[1,2,np.nan,1,22] }
dropna_df = pd.DataFrame( d )
dropna_df

     A    B     C
0  1.0  5.0   1.0
1  2.0  NaN   2.0
2  NaN  NaN   NaN
3  1.0  5.0   1.0
4  NaN  7.0  22.0

In [135]:
dropna_df.dropna( how='any' )

     A    B    C
0  1.0  5.0  1.0
3  1.0  5.0  1.0

In [136]:
dropna_df.dropna( how='all' )

     A    B     C
0  1.0  5.0   1.0
1  2.0  NaN   2.0
3  1.0  5.0   1.0
4  NaN  7.0  22.0

In [137]:
dropna_df.dropna( subset=[ 'B' ] )

     A    B     C
0  1.0  5.0   1.0
3  1.0  5.0   1.0
4  NaN  7.0  22.0

The `thresh` argument defines the number of non-NA values a row or columns needs to not be dropped.

In [138]:
dropna_df.dropna( axis=1, thresh=4 )

      C
0   1.0
1   2.0
2   NaN
3   1.0
4  22.0

### `fillna()`

In [139]:
d = { 'A': [1,2,np.nan,1], 'B':[5,np.nan,np.nan,5], 'C':[1,2,np.nan,1] }
fillna_df = pd.DataFrame( d )
fillna_df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN
3  1.0  5.0  1.0

In [140]:
fillna_df.fillna( 999 )

       A      B      C
0    1.0    5.0    1.0
1    2.0  999.0    2.0
2  999.0  999.0  999.0
3    1.0    5.0    1.0

In [141]:
fillna_df.fillna( method='ffill' )

     A    B    C
0  1.0  5.0  1.0
1  2.0  5.0  2.0
2  2.0  5.0  2.0
3  1.0  5.0  1.0

In [142]:
fillna_df[ 'A' ] = fillna_df[ 'A' ].fillna( value=fillna_df['A'].mean() )
fillna_df

          A    B    C
0  1.000000  5.0  1.0
1  2.000000  NaN  2.0
2  1.333333  NaN  NaN
3  1.000000  5.0  1.0

### `groupby()`

In [143]:
data = {
    'Company': [ 'GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB' ],
    'Person': [ 'Javid', 'Austin', 'Ramiar', 'Arianna', 'Sina', 'Kian' ],
    'Sales': [ 200, 120, 340, 124, 243, 350 ]
}

groupby_df = pd.DataFrame( data )
groupby_df

  Company   Person  Sales
0    GOOG    Javid    200
1    GOOG   Austin    120
2    MSFT   Ramiar    340
3    MSFT  Arianna    124
4      FB     Sina    243
5      FB     Kian    350

In [144]:
print( type( df ) )

byCompany = groupby_df.groupby( 'Company' )
print( type( byCompany ) )

print( type( byCompany.mean() ) )

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<class 'pandas.core.frame.DataFrame'>

In [145]:
byCompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [146]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [147]:
print( byCompany.sum().loc[ 'FB' ] )
print( groupby_df.groupby('Company').sum().loc[ 'FB' ] )

Sales    593
Name: FB, dtype: int64
Sales    593
Name: FB, dtype: int64

In [148]:
byCompany.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [149]:
groupby_df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [150]:
groupby_df.groupby('Company').max()

         Person  Sales
Company
FB         Sina    350
GOOG      Javid    200
MSFT     Ramiar    340

In [151]:
groupby_df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [152]:
groupby_df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [153]:
groupby_df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### `isnull()`

Returns booleans representing whether the value of each cell of the DataFrame was null or not.

In [220]:
df.isnull()

       W      X      Y      Z     W2
A  False  False  False  False  False
B  False  False  False  False  False
C  False  False  False  False  False
D  False  False  False  False  False
E  False  False  False  False  False

### `nunique()`

Returns the number of unique values in a given Series or DataFrame.

In [162]:
stats['IncomeGroup'].nunique()

4

In [163]:
stats.nunique()

CountryName      195
CountryCode      195
BirthRate        177
InternetUsers    181
IncomeGroup        4
dtype: int64

### `pivot_table()`

In [225]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

pivot_table_df = pd.DataFrame(data)
pivot_table_df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [224]:
pivot_table_df.pivot_table(values='D', index=['A', 'B' ], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### `read_csv()`

Reads a csv file into a dataframe.

In [154]:
csv_df = pd.read_csv('../data/Birth-Internet-Income-Per-Country.csv')
csv_df

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

### `reset_index()`

Returns a new DataFrame where the named index is set to a column called `index` and the index becomes numerical. To do it in place, use `inplace=true`.

In [155]:
df.head()

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [156]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

### `set_index()`

In [157]:
new_column = 'CA NY TX FL CO'.split()
df[ 'State' ] = new_column
df.set_index( 'State' )

              W         X         Y         Z
State
CA     0.302665  1.693723 -1.706086 -1.159119
NY    -0.134841  0.390528  0.166905  0.184502
TX     0.807706  0.072960  0.638787  0.329646
FL    -0.497104 -0.754070 -0.943406  0.484752
CO    -0.116773  1.901755  0.238127  1.996652

In [158]:
df.drop( 'State', axis=1, inplace=True, errors='ignore' )
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### `unique()`

Returns the unique values in a given Series.

In [161]:
stats['IncomeGroup'].unique()

array(['High income', 'Low income', 'Upper middle income',
       'Lower middle income'], dtype=object)

### `value_counts()`

The number of times each unique value occurs in a given Series or DataFrame.

In [168]:
stats[ 'IncomeGroup' ].value_counts()

High income            67
Lower middle income    50
Upper middle income    48
Low income             30
Name: IncomeGroup, dtype: int64

In [169]:
stats.value_counts()

CountryName    CountryCode  BirthRate  InternetUsers  IncomeGroup
Zimbabwe       ZWE          35.715     18.5000        Low income             1
Denmark        DNK          10.000     94.6297        High income            1
Guam           GUM          17.389     65.4000        High income            1
Grenada        GRD          19.334     35.0000        Upper middle income    1
Greenland      GRL          14.500     65.8000        High income            1
                                                                            ..
New Zealand    NZL          13.120     82.7800        High income            1
New Caledonia  NCL          17.000     66.0000        High income            1
Netherlands    NLD          10.200     93.9564        High income            1
Nepal          NPL          20.923     13.3000        Low income             1
Afghanistan    AFG          35.253     5.9000         Low income             1
Length: 195, dtype: int64